In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
test_df = pd.read_csv('test.csv')
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df = test_df.copy()

In [4]:
df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# Feature Engineering

First of all I'm dropping some columns because they will not be useful for prediction

In [5]:
df.drop(columns=['PassengerId','Name','Ticket','Cabin'],inplace=True)

In [6]:
df

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male   NaN      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male   NaN      0      0    8.0500        S
417       3    male   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [7]:
na_features = [features for features in df if (df[features].isnull().sum())>0]
na_features

['Age', 'Fare']

In [8]:
categorical_features = df.select_dtypes(include='O')
categorical_features

        Sex Embarked
0      male        Q
1    female        S
2      male        Q
3      male        S
4    female        S
..      ...      ...
413    male        S
414  female        C
415    male        S
416    male        S
417    male        C

[418 rows x 2 columns]

## Filling the missing value

In [9]:
mean_age = df.groupby(['Sex'])['Age'].mean()
mean_age

Sex
female    30.272362
male      30.272732
Name: Age, dtype: float64

In [10]:
df['Age'].fillna(30,inplace=True)
df

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male  30.0      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male  30.0      0      0    8.0500        S
417       3    male  30.0      1      1   22.3583        C

[418 rows x 7 columns]

In [11]:
# a = df.groupby('Sex')['Age'].mean()
df['Embarked'].mode()

0    S
dtype: object

In [12]:
df['Embarked'].fillna(df['Embarked'].mode()[0],inplace=True)

In [13]:
fare = df.groupby('Pclass')['Fare'].mean().to_dict()
fare

{1: 94.28029719626169, 2: 22.20210430107527, 3: 12.459677880184334}

In [14]:
df[df['Fare'].isnull()]

     Pclass   Sex   Age  SibSp  Parch  Fare Embarked
152       3  male  60.5      0      0   NaN        S

In [15]:
df['Fare'].fillna(12.4596,inplace=True)

In [16]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [17]:
# now we don't have any null values

# Feature Engineering

### One hot encoding

In [18]:
for features in categorical_features:
    if features not in 'Name'+'Ticket'+'Cabin':
        dummy = pd.get_dummies(df[features],drop_first=True)
        df = pd.concat([df,dummy],axis=1)
        df.drop(columns=[features],axis=1,inplace=True)

In [19]:
df

     Pclass   Age  SibSp  Parch      Fare  male  Q  S
0         3  34.5      0      0    7.8292     1  1  0
1         3  47.0      1      0    7.0000     0  0  1
2         2  62.0      0      0    9.6875     1  1  0
3         3  27.0      0      0    8.6625     1  0  1
4         3  22.0      1      1   12.2875     0  0  1
..      ...   ...    ...    ...       ...   ... .. ..
413       3  30.0      0      0    8.0500     1  0  1
414       1  39.0      0      0  108.9000     0  0  0
415       3  38.5      0      0    7.2500     1  0  1
416       3  30.0      0      0    8.0500     1  0  1
417       3  30.0      1      1   22.3583     1  0  0

[418 rows x 8 columns]

In [20]:
df.to_csv('test_refined.csv')